{
  "site": {
    "title": "Lembrez Shun",
    "subtitle": "Design & web development — React, TypeScript"
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "popup": {
    "title": "Active Search",
    "showButton": "Internship/Apprenticeship",
    "stage": "Internship",
    "alternance": "Apprenticeship",
    "startDate": "Start Date",
    "duration": "For a duration of",
    "dateStage": "April 13, 2026",
    "dureeStage": "8 to 10 weeks",
    "dateAlternance": "January 2026",
    "contactButton": "Contact Me"
  },
  "home": {
    "bienvenue": "Welcome to my portfolio",
    "title": "Lembrez Shun",
    "subtitle": "Computer Science Student",
    "description": "My name is Lembrez Shun, a second-year Computer Science student at IUT de Lens. Passionate about new technologies, I have discovered and learned many skills through my studies and personal projects. I am curious and motivated, always seeking new challenges to deepen my knowledge in the field of computer science.",
    "aboutButton": "Learn more about me",

    "skillsTitle": "Skills",
    "skillsDescription": "Throughout my studies and projects, I have developed a wide range of skills in web development, object-oriented programming, databases, and more.",
    "viewAllSkills": "View all my skills",

    "projectsTitle": "Recent Projects",
    "projectsDescription": "Discover my recent works, ranging from web development to complete application creation.",
    "project1Title" : "Bomberman",
    "project2Title" : "Website ",
    "viewProjectButton" : "View the project",
    "viewAllProjects": "View all my projects",

    "contactTitle": "Contact Me",
    "contactDescription": "Do you have a project in mind or just want to chat? Feel free to get in touch!",
    "contactButton": "Contact Me via Form"
  },
  "about": {
    "title": "About Me",
    "description": "My name is Lembrez Shun, a second-year student in Bachelor of Technology in Computer Science at IUT de Lens. I am passionate about new technologies, which I have been able to discover and learn through my studies and personal projects. I am curious and motivated, always seeking new challenges to deepen my knowledge in the field of computer science.",
  
    "titleFormations": "Formations",
    "titleF1": "Bachelor of Technology in Computer Science",
    "institutionF1": "University Institute of Technology (IUT) of Lens",
    "periodF1": "September 2024 - Present",
    "descriptionF1": "Training focused on software development, including programming in Java, Python, and PHP, database management with SQLite and PostgreSQL, as well as web application design. Participation in collaborative projects and learning of agile methodologies.",
  
    "titleF2": "French Baccalaureate",
    "institutionF2": "Lycée Anatole France, Lillers",
    "periodF2": "September 2021 - July 2024",
    "descriptionF2": "High honors – Specializations: Mathematics, Computer Science and Digital Sciences (NSI) Option: Advanced Mathematics",
    "mentionF2": "High Honors",
    "specialitiesLabelF2": "Specializations:",
    "specialitiesF2": "Mathematics, Computer Science and Digital Sciences (NSI)",
    "optionLabelF2": "Option:",
    "optionF2": "Advanced Mathematics",

    "titleExperiences": "Experiences",
    "titleE1": "Student Tutor – Academic Support",
    "companyE1": "University Institute of Technology (IUT) of Lens",
    "periodE1": "September 2025 – Present",
    "descriptionE1": "Weekly tutoring sessions for first-year students: assisting with course understanding, providing personalized support, and monitoring academic progress. Developed strong skills in pedagogy, communication, and organization.",

    "titleE2": "Observation Internship – IT Department",
    "companyE2": "ALKERN",
    "periodE2": "June 2021",
    "descriptionE2": "Full immersion in a corporate IT department: user support, system maintenance, and introduction to software development.",
    "Tirer1E2": "Backup management and technical support (hardware/software)",
    "Tirer2E2": "Exposure to professional programming languages: PHP, LANSA, RPG",
    "Tirer3E2": "Infrastructure: Windows servers, IBM AS/400, networking & IP telephony",
    "projectLinkE2": "https://alkern.zerbmel.fr/",
    "projectButtonE2": "View the created website",

    "swercTitle": "Participation in SWERC 2025",
    "swercDesc1": "In January 2025, I had the honor of representing the IUT of Lens at SWERC (Southwestern Europe Regional Contest), an international algorithmic competition organized by the ICPC.",
    "swercDesc2": "The contest brought together teams from prestigious universities across Europe, where we worked on challenging problems involving algorithms, logic, and optimization.",
    "swercDesc3": "This experience strengthened my rigor, teamwork under pressure, and passion for competitive programming.",
    "swercButton": "Official website",
    "swercLink": "https://swerc.eu",
    "swercLinkedInLink": "https://www.linkedin.com/posts/shun-lembrez_swerc-activity-7398752563854188544-7udw?utm_source=share&utm_medium=member_desktop&rcm=ACoAAF8EzdkBTMZNGtflD8RWtWPfK_RkzcO85nQ",
    "swercLinkedInButton": "Post LinkedIn",

    "passionTitle": "My Passion for Computer Science",
    "passionIntro": "Since my childhood, I have always been drawn to computers, video games, and the desire to always know \"How does this work?\"",
    "passionLycee": "At first, it was mainly mathematics that interested me, long before I discovered the Digital and Computer Science (NSI) specialization, which precisely combines math and computer science. In middle school, there wasn’t really an equivalent subject: the closest was visual arts, where I often stood out thanks to original projects. I loved experimenting and innovating, whether with 3D printing, laser engraving, or creating websites. This curiosity naturally led me to choose the NSI specialization in high school, which I immediately enjoyed. There, I discovered programming and wrote my first lines of code, notably in Python and HTML/CSS.",
    "passionBUT": "My first year of the undergraduate program confirmed my interest in computer science, and more specifically in development. I was able to acquire a solid foundation and learned to work in a team on my first \"real\" projects.",
    "beyondCodeTitle": "Beyond the Code?",
    "sportTitle": "Sports",
    "sportDesc1": "I also enjoy practicing sports, especially rock climbing, which gives me a real sense of freedom, as well as swimming occasionally to stay fit.",
    "sportDesc2": "I also practice target shooting from time to time — a passion I probably developed thanks to video games. I enjoy anything that requires precision and control, qualities I find in this discipline.",
    "pianoTitle": "Piano",
    "pianoDesc": "I recently started playing the piano, in September 2024, and I am learning as a self-taught musician. I enjoy discovering new things and progressing on my own, which makes this activity particularly stimulating.",
    "gamingTitle": "Video Games",
    "gamingDesc1": "I also play video games that combine competition, strategy, and cooperation, such as Overwatch, where I reached the Top 150 European ranking in 2020.",
    "gamingDesc2": "I also enjoy narrative-driven games, such as Expedition 33, an exceptional French game with incredible music and atmosphere.",
    "beyondCodeConclusion": "These passions nurture my curiosity, creativity, and logical thinking — qualities that are essential in software development."
  },
  "buttons": {
    "downloadCV": "Download CV"
  },
  "skills": {
    "title": "My Skills",
    "subtitle": "Technologies and tools I master to bring your projects to life",
    "category": {
      "frontend": "Web Development",
      "frameworks": "Frameworks",
      "appdev": "App Development",
      "databases": "Databases",
      "tools": "Tools"
    }
  },
  "projects": {
    "title": "My Projects",
    "subtitle": "Discover my creations and experiments",
    "viewDemo": "View Demo",
    
    "categoryP1": "Java App",
    "dateP1": "2025",
    "titleP1": "Bomberman JavaFX",
    "imageP1": "/images/project1.png",
    "descriptionP1": "A Bomberman project developed in Java with a graphical interface using JavaFX.",
    "techP1": ["Java", "JavaFX", "FXML", "Maven", "Git", "GitHub"],
    "demoLinkP1": "",
    "githubLinkP1": "https://github.com/Shun-codes/BombermanJavaFX",
    
    "categoryP2": "Website",
    "dateP2": "2024",
    "titleP2": "L’Air du Cinéma",
    "imageP2": "/images/project2.png",
    "descriptionP2": "L’Air du Cinéma is a static website created as part of a first-semester project. It represents a fictional company specializing in organizing outdoor cinema events.",
    "techP2": ["HTML", "CSS","Git", "GitHub"],
    "githubLinkP2": "https://github.com/Shun-codes/L-Air-du-Cinema"
  },
  "contact": {
    "title": "Contact Me",
    "intro": "Below you’ll find my contact details as well as a form if you’d like to reach out directly by email.",
    "infoTitle": "My Contact Information",
    "email": "Email",
    "linkedin": "LinkedIn",
    "phone": "Phone",
    "formTitle": "Contact Form",
    "form": {
      "name": "Name",
      "email": "Email",
      "subject": "Subject",
      "message": "Message",
      "submit": "Send Message",
      "sending": "Sending...",
      "success": "Message sent successfully!",
      "error": "An error occurred. Please try again."
    }
  },
  "footer": {
    "text": "Lembrez Shun. All rights reserved."
  }
}
