{
  "site": {
    "title": "Lembrez Shun",
    "subtitle": "Design & développement web — React, TypeScript"
  },
  "nav": {
    "home": "Accueil",
    "about": "À propos",
    "skills": "Compétences",
    "projects": "Projets",
    "contact": "Contact"
  },
  "popup" : {
    "title": "Recherche active",
    "showButton": "Stage/Alternance",
    "stage" : "Stage",
    "alternance" : "Alternance",
    "startDate": "Date de début",
    "duration": "Pour une durée de",
    "dateStage": "13 Avril 2026",
    "dureeStage": "8 à 10 semaines",
    "dateAlternance": "Janvier 2026",
    "contactButton": "Me contacter"
  },
  "home": {
    "bienvenue": "Bienvenue sur mon portfolio",
    "title": "Lembrez Shun",
    "subtitle": "Étudiant en BUT Informatique",
    "description": "Je m'appelle Lembrez Shun, étudiant en deuxième année de BUT Informatique à l'IUT de Lens. Je suis passionné par les nouvelles technologies, j'ai pu en découvrir et en apprendre de nouvelles à travers mes études et mes projets personnels. Je suis curieux et motivé, et toujours à la recherche de nouveaux défis pour approfondir mes connaissances dans le domaine de l'informatique.",
    "aboutButton": "En savoir plus sur moi",

    "skillsTitle": "Compétences",
    "skillsDescription": "Au cours de ma formation et de mes projets, j'ai développé des compétences variées en développement web, programmation orientée objet, bases de données et bien plus encore.",
    "viewAllSkills": "Voir toutes mes compétences",

    "projectsTitle": "Projets récents",
    "projectsDescription": "Découvrez mes réalisations récentes, allant du développement web à la création d'applications complètes.",
    "project1Title" : "Bomberman",
    "project2Title" : "Site Web entreprise",
    "viewProjectButton" : "Voir le projet",
    "viewAllProjects": "Voir tous mes projets",

    "contactTitle" : "Contactez-moi",
    "contactDescription" : "Vous avez un projet en tête ou souhaitez simplement échanger ? N'hésitez pas à me contacter !",
    "contactButton" : "Me contacter par formulaire"
  },
  "about": {
    "title": "À propos de moi",
    "description": "Je m'appelle Lembrez Shun, étudiant en deuxième année de BUT Informatique à l'IUT de Lens. Je suis passionné par les nouvelles technologies, j'ai pu en découvrir et en apprendre de nouvelles, à travers mes études et mes projets personnels. Je suis Curieux et motivé, et toujours à la recherche de nouveaux défis pour pour approfondir mes connaissances dans le domaine de l'informatique.",
    
    "titleFormations": "Formations",
    "titleF1": "BUT Informatique",
    "institutionF1": "IUT de Lens",
    "periodF1": "Septembre 2024 - Présent",
    "descriptionF1": "Formation axée sur le développement logiciel, incluant la programmation en Java, Python, et PHP, la gestion de bases de données SQLite et PostgreSQL, ainsi que la conception d'applications web. Participation à des projets collaboratifs et apprentissage des méthodes agiles.",
    
    "titleF2": "Baccalauréat général",
    "institutionF2": "Lycée Anatole France, Lillers",
    "periodF2": "Septembre 2021 - Juillet 2024",
    "descriptionF2": "Mention Très Bien Spécialités : Mathématiques, Numérique et Sciences Informatiques (NSI) Option : Mathématiques Expertes",
    "mentionF2": "Mention Très Bien",
    "specialitiesLabelF2": "Spécialités :",
    "specialitiesF2": "Mathématiques, Numérique et Sciences Informatiques (NSI)",
    "optionLabelF2": "Option :",
    "optionF2": "Mathématiques Expertes",

    "titleExperiences": "Expériences",
    "titleE1": "Tuteur étudiant - Accompagnement pédagogique",
    "companyE1": "IUT de Lens",
    "periodE1": "Septembre 2025 - Présent",
    "descriptionE1": "Tutorats hebdomadaires auprès d’étudiants de première année : aide à la compréhension des cours, soutien personnalisé et suivi de progression. Développement de compétences en pédagogie, communication et organisation.",

    "titleE2": "Stage d'observation en service informatique",
    "companyE2": "ALKERN",
    "periodE2": "Juin 2021",
    "descriptionE2": "Immersion complète dans un service informatique d'entreprise : support utilisateur, maintenance système et découverte du développement.",
    "Tirer1E2": "Gestion des sauvegardes et support technique (hardware/software)",
    "Tirer2E2": "Découverte langages pro : PHP, LANSA, RPG",
    "Tirer3E2": "Infrastructure : serveurs Windows, IBM AS/400, réseau & téléphonie IP",
    "projectLinkE2": "https://alkern.zerbmel.fr/",
    "projectButtonE2": "Voir le site créé",

    "swercTitle": "Participation au SWERC 2025",
    "swercDesc1": "En janvier 2025, j’ai eu l’honneur de représenter l’IUT de Lens lors du SWERC (Southwestern Europe Regional Contest), une compétition internationale d’algorithmique organisée par l’ICPC.",
    "swercDesc2": "Ce concours regroupait des équipes venues d’universités prestigieuses à travers toute l’Europe, et nous avons eu l’opportunité de travailler sur des problèmes exigeants en algorithmie, logique et optimisation.",
    "swercDesc3": "Cette expérience m’a permis de renforcer ma rigueur, ma capacité à collaborer efficacement sous pression et ma passion pour la programmation compétitive.",
    "swercButton": "Voir le site officiel",
    "swercLink": "https://swerc.eu",
    "swercLinkedInLink": "https://www.linkedin.com/posts/shun-lembrez_swerc-activity-7398752563854188544-7udw?utm_source=share&utm_medium=member_desktop&rcm=ACoAAF8EzdkBTMZNGtflD8RWtWPfK_RkzcO85nQ",
    "swercLinkedInButton": "Post LinkedIn",

    "passionTitle": "Ma passion pour l'informatique",
    "passionIntro": "Depuis mon enfance, j'ai toujours été attirée par l'informatique (l'ordinateur, les jeux vidéo et l'envie de toujours savoir \"Comment ça marche ça ?\")",
    "passionLycee": "Au départ, c’est surtout les mathématiques qui m’attiraient, bien avant que je ne découvre la spécialité Numérique et Sciences de l’Informatique (NSI), qui mêle justement des notions de maths et d’informatique. Au collège, il n’existait pas vraiment de matière équivalente : le plus proche était l’art plastique, où je me démarquais souvent grâce à des projets originaux. J’aimais expérimenter et innover, que ce soit avec l’impression 3D, la gravure laser ou la création de sites web. Cette curiosité m’a naturellement conduite à choisir la spécialité NSI au lycée, qui m’a tout de suite beaucoup plu. J’y ai découvert la programmation et écrit mes premières lignes de code, notamment en Python et en HTML/CSS",
    "passionBUT": "Ma première année de BUT a confirmé mon intérêt pour l'informatique, et plus précisément pour le développement. J'ai pu acquérir des bases solides et appris à travailler en équipe sur mes premiers \"vrais\" projets.",
    "beyondCodeTitle": "Et au-delà du code ?",
    "sportTitle": "Sport",
    "sportDesc1": "J’aime aussi faire du sport, notamment l’escalade, qui me procure un vrai sentiment de liberté, ainsi que la natation rarement.",
    "sportDesc2":  "Je fais également du tir sportif de temps en temps — une passion que j’ai probablement développée grâce aux jeux vidéo. J’aime tout ce qui demande précision et maîtrise, des qualités que je retrouve dans cette discipline.",
    "pianoTitle": "Piano",
    "pianoDesc": "Je me suis récemment mis au piano, en septembre 2024, et j’apprends en autodidacte. J’aime découvrir de nouvelles choses et progresser par moi-même, ce qui rend cette activité particulièrement stimulante.",
    "gamingTitle": "Jeux vidéo",
    "gamingDesc1": "Je joue également à des jeux vidéo mêlant compétition, stratégie et coopération, comme Overwatch, où j’ai atteint le Top 150 européen en 2020.",
    "gamingDesc2": "J’apprécie aussi les jeux narratifs, tels que Expedition 33, un jeu français exceptionnel avec une ambiance et des musiques incroyables.",
    "beyondCodeConclusion": "Ces passions nourrissent ma curiosité, ma créativité et ma logique — des qualités essentielles dans le développement informatique."
  },
  "buttons": {
    "downloadCV": "Télécharger le CV"
  },
  "skills": {
    "title": "Mes Compétences",
    "subtitle": "Technologies et outils que je maîtrise pour donner vie à vos projets",
    "category": {
      "frontend": "Développement Web",
      "frameworks": "Frameworks",
      "appdev": "Développement d'application",
      "databases": "Bases de données",
      "tools": "Outils"
    }
  },
  "projects": {
    "title": "Mes Projets",
    "subtitle": "Découvrez mes réalisations et expérimentations",
    "viewDemo": "Voir la démo",
    
    "categoryP1": "App Java",
    "dateP1": "2025",
    "titleP1": "Bomberman JavaFX",
    "imageP1": "/images/project1.png",
    "descriptionP1": "Un projet de Bomberman développé en Java avec une interface graphique en JavaFX.",
    "techP1": ["Java", "JavaFX", "FXML", "Maven", "Git", "GitHub"],
    "demoLinkP1": "",
    "githubLinkP1": "https://github.com/Shun-codes/BombermanJavaFX",
    
    "categoryP2": "Site Web",
    "dateP2": "2024",
    "titleP2": "L’Air du Cinéma",
    "imageP2": "/images/project2.png",
    "descriptionP2": "L’Air du Cinéma est un site web statique créé dans le cadre du projet du premier semestre. Il s’agit d’une entreprise fictive spécialisée dans l’organisation d’événements cinéma en plein air.",
    "techP2": ["HTML", "CSS","Git", "GitHub"],
    "githubLinkP2": "https://github.com/Shun-codes/L-Air-du-Cinema"
  },
  "contact": {
    "title": "Contactez-moi",
    "intro": "Vous trouverez ci-dessous mes coordonnées ainsi qu’un formulaire de contact si vous souhaitez échanger directement par mail.",
    "infoTitle": "Mes coordonnées",
    "email": "Email",
    "linkedin": "LinkedIn",
    "phone": "Téléphone",
    "formTitle": "Formulaire de contact",
    "form": {
      "name": "Nom",
      "email": "Email",
      "subject": "Objet",
      "message": "Message",
      "submit": "Envoyer le message",
      "sending" : "Envoi en cours...",
      "success" : "Message envoyé avec succès !",
      "error": "Une erreur est survenue. Réessayez."
    }
  },
  "footer": {
    "text": "Lembrez Shun. Tous droits réservés."
  }
}
